
<!-- header -->
```fish
plan -chdir=terraform/development -detailed-exitcode=true -lock=false
```
<!-- fmt -->

<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
+ aws_default_security_group.default will be created
+ aws_internet_gateway.gitops_igw will be created
+ aws_route_table.gitops_rt will be created
+ aws_route_table_association.gitops_rta will be created
+ aws_subnet.gitops_subnet will be created
+ aws_vpc.gitops_vpc will be created
```
</details>
<!-- main -->
<details><summary>Plan: 6 to add, 0 to change, 0 to destroy.</br>

###### Terraform CI by @chris3ware via [pull_request](https://github.com/3ware/gitops-2024/actions/runs/11428400658/job/31793604835) at 2024-10-20T17:50:24Z.
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_internet_gateway.gitops_igw will be created
  + resource "aws_internet_gateway" "gitops_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "gitops-igw-development"
        }
      + tags_all = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "gitops-igw-development"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.gitops_rt will be created
  + resource "aws_route_table" "gitops_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "gitops-rt-development"
        }
      + tags_all         = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "gitops-rt-development"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.gitops_rta will be created
  + resource "aws_route_table_association" "gitops_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.gitops_subnet will be created
  + resource "aws_subnet" "gitops_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "gitops-subnet-development"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "gitops-subnet-development"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.gitops_vpc will be created
  + resource "aws_vpc" "gitops_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "gitops-vpc-development"
        }
      + tags_all                             = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "gitops-vpc-development"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_account_id = (sensitive value)
  + default_tags   = {
      + "3ware:environment"          = "development"
      + "3ware:managed-by-terraform" = "true"
      + "3ware:project-id"           = "gitops-2024"
      + "3ware:workspace"            = "app-us-east-1-development"
    }

Warning: Value for undeclared variable

The root module does not declare a variable named "instance_type" but a value
was found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

```
</details>
<!-- footer -->
<!-- terraform.15.-chdir-terraform-development.-out-tfplan-ci-terraform-ci-PR15-check -->